[
  {
    "productId": 1,
    "name": "Awei T29 Pro Gaming Earbuds",
    "images": [
      "https://www.startech.com.bd/image/cache/catalog/earbuds/awei/t29-pro/t29-pro-01-500x500.webp",
      "https://www.startech.com.bd/image/cache/catalog/earbuds/awei/t29-pro/t29-pro-03-500x500.webp",
      "https://www.startech.com.bd/image/cache/catalog/earbuds/awei/t29-pro/t29-pro-500x500.webp"
    ],
    "shortDescription": "Compact and high-quality sound.",
    "longDescription": "The Awei T29 Pro Gaming Earbuds are an advanced audio solution for gamers, providing greater sound quality and comfort throughout long gaming sessions. With an IPX6 waterproof rating, these Earbuds have brilliant RGB illumination in seven colors and are designed to survive hard gameplay. It gives a competitive advantage with decreased latency and lag-free audio, with a runtime of up to 7 hours. The Awei T29 Pro Gaming Earbuds are Bluetooth V5.1 compliant, and they support protocols such as HSP, HFP, A2DP, and AVRCP. The Earbuds have a 45mAh battery for longer use and a 500mAh charging bin for everyday use. The Awei T29 Pro Gaming Earbuds produce crystal-clear music with a 32 ohm impedance and a sensitivity of 963 dB.Extremely fast Bluetooth connection:The AWEI T29 Pro Earbuds charging box connects to a mobile phone&aposs Bluetooth automatically when it is turned on, has a 65ms ultra-low latency, is more than three times faster than conventional Bluetooth headsets, is specifically made for gamers, and features cool RGB lighting effects, a 10mm speaker unit, HIFI Fever sound quality, intelligent analysis and debugging, and wonderful original sound.Game Music Dual Mode:In game mode, Awei T29 Pro Gaming Earbuds can precisely record the sound of footsteps, firearms, and cars, and it can rapidly dispatch the enemy in combat. It has a sensitive switch between games and music. You get more engaged in the game due to the breathing light that comes with the headgear. Double the gaming experience, game scene:Buy Awei T29 Pro Gaming Earbuds from Star Tech.In Bangladesh, you can get original Awei T29 Pro Gaming Earbuds From Star Tech. We have a large collection of latest Awei Earbuds to purchase. Order Online Or Visit your Nearest Star Tech Shop to get yours at lowest price. The Awei T29 Pro Gaming Earbuds comes with no warranty.",
    "regularPrice": 59.99,
    "discountPrice": 49.99,
    "category": "Earbuds",
    "brand": "Awei",
    "tags": ["wireless", "audio", "earbuds"],
    "availability": "In Stock"
  }
]
